src/InformationRegisters/ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPСервисы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнееПриложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ApiKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтносительныйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЭвотор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>UIDЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/HTTPСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>HTTPСервисы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Analytics</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Apex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Director</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Evotor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IronLogic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Lead</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mandarin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Messenger</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧатБот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BePaid</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗапросов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TimedOut</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаApiKey</Name>
					<Comment>Не передан ApiKey</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВнешнейСистемы</Name>
					<Comment>Не найдена внешняя система</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСоединения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/HTTPServices/Lead/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает результат создания заявки, со стандартными параметрами.
//
Функция WebhookPOST(Запрос)
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Попытка
		
		ApiKey         = Запрос.ПараметрыURL.Получить("apikey");
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, Перечисления.ТипыВнешнихСистем.Webhook, Истина);
		
		// Логирование
		ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
		
		Если ЛогироватьСобытие > 0 Тогда
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Lead;
			HTTPШаблон     = "Webhook";
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда		
			ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, Перечисления.ТипыВнешнихСистем.Chat2Desk, Истина);
			Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
				
				HTTPОтвет = Новый HTTPСервисОтвет(400);
				HTTPОтвет.УстановитьТелоИзСтроки("Внешняя система не найдена");
				
				// Логирование
				Если ЛогироватьСобытие > 0 Тогда
					
					ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
					мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					Перечисления.СтатусыЗапросов.ЗавершенСОшибками, 
					ВремяВыполнения, 
					, 
					, 
					мОтвет, 
					, 
					,
					400);
					
				КонецЕсли;
				Возврат HTTPОтвет;
				
			КонецЕсли;	
		КонецЕсли;
		
		ТекстJSON     = Запрос.ПолучитьТелоКакСтроку();
		ЧтениеJSON    = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
		
		Если ПараметрыJSON.Свойство("marketing") И ТипЗнч(ПараметрыJSON.marketing) = Тип("Структура") Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыJSON.marketing Цикл
				Если Не ПараметрыJSON.Свойство(КлючИЗначение.Ключ) Тогда
					ПараметрыJSON.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		НомерТелефона    = ?(ПараметрыJSON.Свойство("phone")       , ПараметрыJSON.Phone       , Неопределено);
		АдресЭП          = ?(ПараметрыJSON.Свойство("email")       , ПараметрыJSON.Email       , Неопределено);
		Имя              = ?(ПараметрыJSON.Свойство("name")        , ПараметрыJSON.Name        , Неопределено);
		Фамилия          = ?(ПараметрыJSON.Свойство("last_name")   , ПараметрыJSON.last_name   , Неопределено);
		Коментарий       = ?(ПараметрыJSON.Свойство("comment")     , ПараметрыJSON.comment     , Неопределено);
		utm_campaign	 = ?(ПараметрыJSON.Свойство("utm_campaign"), ПараметрыJSON.utm_campaign, Неопределено);
		utm_content	     = ?(ПараметрыJSON.Свойство("utm_content") , ПараметрыJSON.utm_content , Неопределено);
		utm_medium	     = ?(ПараметрыJSON.Свойство("utm_medium")  , ПараметрыJSON.utm_medium  , Неопределено);
		utm_source	     = ?(ПараметрыJSON.Свойство("utm_source")  , ПараметрыJSON.utm_source  , Неопределено);
		utm_term	     = ?(ПараметрыJSON.Свойство("utm_term")    , ПараметрыJSON.utm_term    , Неопределено);
		ga_cid		     = ?(ПараметрыJSON.Свойство("ga_cid")	   , ПараметрыJSON.ga_cid	   , Неопределено);
		ym_cid		     = ?(ПараметрыJSON.Свойство("ym_cid")	   , ПараметрыJSON.ym_cid	   , Неопределено);
		rs_cid		     = ?(ПараметрыJSON.Свойство("rs_cid")	   , ПараметрыJSON.rs_cid	   , Неопределено);
		rs_vid		     = ?(ПараметрыJSON.Свойство("rs_vid")	   , ПараметрыJSON.rs_vid	   , Неопределено);
		ct_cid		     = ?(ПараметрыJSON.Свойство("ct_cid")	   , ПараметрыJSON.ct_cid	   , Неопределено);
		
		ВремяСоздания    = ТекущаяДатаСервера();
		
		Клиент = Неопределено;
		Если ЗначениеЗаполнено(НомерТелефона) Тогда
			Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Имя)
			И НЕ ЗначениеЗаполнено(Фамилия) Тогда
			Имя = НомерТелефона;
		КонецЕсли;
		
		ПараметрыUTM = Новый Структура();
		ПараметрыUTM.Вставить("source"  , utm_source  );
		ПараметрыUTM.Вставить("medium"  , utm_medium  );
		ПараметрыUTM.Вставить("campaign", utm_campaign);
		ПараметрыUTM.Вставить("content" , utm_content );
		ПараметрыUTM.Вставить("term"    , utm_term    );
		ПараметрыUTM.Вставить("ga_cid"  , ga_cid      );
		ПараметрыUTM.Вставить("ym_cid"  , ym_cid      );
		ПараметрыUTM.Вставить("rs_cid"  , rs_cid      );
		ПараметрыUTM.Вставить("rs_vid"  , rs_vid      );
		ПараметрыUTM.Вставить("ct_cid"  , ct_cid	  );
		
		Если ЗначениеЗаполнено(utm_content) Тогда
			РекламнаяПлощадка = Справочники.КаналыПривлечения.НайтиПоНаименованию(utm_content);
			Если НЕ ЗначениеЗаполнено(РекламнаяПлощадка) Тогда
				РекламнаяПлощадка = Справочники.КаналыПривлечения.СоздатьЭлемент();
				РекламнаяПлощадка.Наименование = utm_content;
				РекламнаяПлощадка.Записать();
				РекламнаяПлощадка = РекламнаяПлощадка.Ссылка;
			КонецЕсли;
		Иначе
			РекламнаяПлощадка = Справочники.КаналыПривлечения.ЛовецЛидов;
		КонецЕсли;   
		
		СтруктурнаяЕдиница = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВнешняяСистема, "СтруктурнаяЕдиница");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОнлайнЗаявка", Истина);
		
		// Создаем входящую заявку.
		Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,
		ВремяСоздания,
		Фамилия,
		Имя,,
		НомерТелефона,
		АдресЭП,,
		РекламнаяПлощадка,,
		Коментарий,
		ПараметрыUTM,
		ВнешняяСистема,,
		Клиент,
		СтруктурнаяЕдиница,,
		ДополнительныеПараметры);
		
		HTTPОтвет = Новый HTTPСервисОтвет(200);
		HTTPОтвет.УстановитьТелоИзСтроки("ok");
		КодОтвета = 200;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		HTTPОтвет = Новый HTTPСервисОтвет(400);
		HTTPОтвет.УстановитьТелоИзСтроки(ОписаниеОшибки);
		КодОтвета = 400;
	КонецПопытки;
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
		Статус                 = ?(КодОтвета = 400, Перечисления.СтатусыЗапросов.ЗавершенСОшибками, Перечисления.СтатусыЗапросов.Выполнен);
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, Статус, ВремяВыполнения) Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			Статус, 
			ВремяВыполнения, 
			ВнешняяСистема, 
			, 
			мОтвет, 
			, 
			,
			КодОтвета); 								
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция, возвращает результат создания заявки, c TapLink.
//
Функция TapLinkPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ApiKey         = Запрос.ПараметрыURL.Получить("apikey");
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, Перечисления.ТипыВнешнихСистем.TapLink);
		
		// Логирование
		ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
		
		Если ЛогироватьСобытие > 0 Тогда
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Lead;
			HTTPШаблон     = "TapLink";
		КонецЕсли;
		//\\
		
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда			
			
			HTTPОтвет = ПолучитьHTTPОтвет(400, "Внешняя система не найдена.");	
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
				
				РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
				HTTPЗапросЛога, 
				ДатаЛога, 
				UIDЗапроса, 
				ТипЗапроса, 
				HTTPШаблон, 
				Перечисления.СтасусыЗапросов.ЗавершенСОшибками, 
				ВремяВыполнения, 
				, 
				, 
				мОтвет, 
				, 
				,
				400); 								
				
			КонецЕсли;
			Возврат HTTPОтвет;
			
		КонецЕсли;
		
		Если Запрос.Заголовки.Получить("Content-Type") = "application/json" Тогда
			ПараметрыТела = ДекодироватьИзJSON(Запрос.ПолучитьТелоКакСтроку());	
		Иначе
			
			ТелоЗапроса   = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);	
			ПараметрыТела = Новый Структура();
			
			// При преобразовании тела в параметры заменяю "+" на кодировку пробела, 
			// Т.к. параметры приходят перемешанно-закодированными.
			МассивПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РаскодироватьСТроку(СтрЗаменить(Запрос.ПолучитьТелоКакСтроку(), "+", "%20"), СпособКодированияСтроки.КодировкаURL), "&");
			
			Для Каждого ЭлементМассива Из МассивПараметров Цикл	
				ПозицияРазделителя	 = СтрНайти(ЭлементМассива, "=");
				Ключ				 = Сред(ЭлементМассива, 1, ПозицияРазделителя - 1);
				Значение			 = Сред(ЭлементМассива, ПозицияРазделителя + 1);
				РаспарситьСтроку(ПараметрыТела, Ключ, Значение); 				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ (ПараметрыТела.Свойство("action") И ПараметрыТела.action = "leads.created" И ПараметрыТела.Свойство("data")) Тогда
			HTTPОтвет = ПолучитьHTTPОтвет(200, "Заявка не обработана!");
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
				Стасус                 = Перечисления.СтасусыЗапросов.Выполнен;
				
				Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, Стасус, ВремяВыполнения) Тогда
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					Стасус, 
					ВремяВыполнения, 
					ВнешняяСистема, 
					, 
					мОтвет, 
					, 
					,
					200); 								
					
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат HTTPОтвет;
			
		КонецЕсли;
		
		НомерТелефона    = ?(ПараметрыТела.data.Свойство("phone")       , ПараметрыТела.data.Phone       , Неопределено);
		АдресЭП          = ?(ПараметрыТела.data.Свойство("email")       , ПараметрыТела.data.Email       , Неопределено);
		Имя              = ?(ПараметрыТела.data.Свойство("fullname")    , ПараметрыТела.data.fullname    , Неопределено);
		ДанныеЗаписи     = ?(ПараметрыТела.data.Свойство("records")     , ПараметрыТела.data.records     , Неопределено);
		utm_campaign	 = ?(ПараметрыТела.data.Свойство("utm_campaign"), ПараметрыТела.data.utm_campaign, Неопределено);
		utm_content	     = ?(ПараметрыТела.data.Свойство("utm_content") , ПараметрыТела.data.utm_content , Неопределено);
		utm_medium	     = ?(ПараметрыТела.data.Свойство("utm_medium")  , ПараметрыТела.data.utm_medium  , Неопределено);
		utm_source	     = ?(ПараметрыТела.data.Свойство("utm_source")  , ПараметрыТела.data.utm_source  , Неопределено);
		utm_term	     = ?(ПараметрыТела.data.Свойство("utm_term")    , ПараметрыТела.data.utm_term    , Неопределено);
		ВремяСоздания    = ТекущаяДатаСервера();
		
		Коментарий = "";
		Если ТипЗнч(ДанныеЗаписи) = Тип("Массив") Тогда		
			Для Каждого ЭлементМ Из ДанныеЗаписи Цикл
				Коментарий = Коментарий + ЭлементМ.title + ": " + ЭлементМ.value + Символы.ПС;	
			КонецЦикла;
		КонецЕсли;	
		
		Клиент = Неопределено;
		Если ЗначениеЗаполнено(НомерТелефона) Тогда
			Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Имя = НомерТелефона;
		КонецЕсли;
		
		ПараметрыUTM = Новый Структура();
		ПараметрыUTM.Вставить("source"  , utm_source  );
		ПараметрыUTM.Вставить("medium"  , utm_medium  );
		ПараметрыUTM.Вставить("campaign", utm_campaign);
		ПараметрыUTM.Вставить("content" , utm_content );
		ПараметрыUTM.Вставить("term"    , utm_term    );
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОнлайнЗаявка", Истина);
		
		// Создаем входящую заявку.
		Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,
		ВремяСоздания,,
		Имя,,
		НомерТелефона,
		АдресЭП,,
		Справочники.КаналыПривлечения.ЛовецЛидов,
		"https://taplink.ru",
		Коментарий,
		ПараметрыUTM,
		ВнешняяСистема,,
		Клиент,
		ВнешняяСистема.СтруктурнаяЕдиница,,
		ДополнительныеПараметры);
		
		HTTPОтвет = ПолучитьHTTPОтвет(200, "Заявка обработана");
		КодОтвета = 200;
		
	Исключение
		
		HTTPОтвет = ПолучитьHTTPОтвет(400, ОписаниеОшибки());	
		КодОтвета = 400;
		
	КонецПопытки;	
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
		Стасус                 = ?(КодОтвета = 400, Перечисления.СтасусыЗапросов.ЗавершенСОшибками, Перечисления.СтасусыЗапросов.Выполнен);
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, Стасус, ВремяВыполнения)Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			Стасус, 
			ВремяВыполнения, 
			ВнешняяСистема, 
			, 
			мОтвет, 
			, 
			,
			КодОтвета); 								
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция, является основной точкой входа для метода POST.
//
Функция marquizPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ApiKey         = Запрос.ПараметрыURL.Получить("apikey");
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, Перечисления.ТипыВнешнихСистем.Marquiz);
		
		// Логирование
		ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
		
		Если ЛогироватьСобытие > 0 Тогда
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Lead;
			HTTPШаблон     = "marquiz";
			
		КонецЕсли;
		//\\
		
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда				
			HTTPОтвет = ПолучитьHTTPОтвет(400, "Внешняя система не найдена.");	
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
				Стасус                 = Перечисления.СтасусыЗапросов.ЗавершенСОшибками;
				
				РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
				HTTPЗапросЛога, 
				ДатаЛога, 
				UIDЗапроса, 
				ТипЗапроса, 
				HTTPШаблон, 
				Стасус, 
				ВремяВыполнения, 
				, 
				, 
				мОтвет, 
				, 
				,
				400); 								
				
			КонецЕсли;
			Возврат HTTPОтвет;
		КонецЕсли;
		
		ТекстJSON     = Запрос.ПолучитьТелоКакСтроку();
		ЧтениеJSON    = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
		
		Если НЕ ПараметрыJSON.Свойство("contacts") Тогда
			
			HTTPОтвет = Новый HTTPСервисОтвет(400, "Не заполнен параметр contacts.");	
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
				Стасус                 = Перечисления.СтасусыЗапросов.ЗавершенСОшибками;
				
				РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
				HTTPЗапросЛога, 
				ДатаЛога, 
				UIDЗапроса, 
				ТипЗапроса, 
				HTTPШаблон, 
				Стасус, 
				ВремяВыполнения, 
				, 
				, 
				мОтвет, 
				, 
				,
				400); 								
				
			КонецЕсли;
			Возврат HTTPОтвет;
			
		КонецЕсли;	
		
		НомерТелефона    = ?(ПараметрыJSON.contacts.Свойство("phone"), ПараметрыJSON.contacts.phone	, Неопределено);
		АдресЭП          = ?(ПараметрыJSON.contacts.Свойство("email"), ПараметрыJSON.contacts.email	, Неопределено);
		Имя              = ?(ПараметрыJSON.contacts.Свойство("name") , ПараметрыJSON.contacts.name	, Неопределено);
		ДанныеЗаписи     = ?(ПараметрыJSON.Свойство("answers")       , ПараметрыJSON.answers		, Неопределено);
		РезультатОпроса	 = ?(ПараметрыJSON.Свойство("result")		 , ПараметрыJSON.result			, Неопределено);
		
		ДополнительнаяКонтактнаяИнформация = СформироватьСтруктуруКонтактнойИнформации(ПараметрыJSON.contacts);
		
		ПараметрыUTM    = Новый Структура();
		ga              = Неопределено;
		ym_cid          = Неопределено;
		СсылкаИсточника = "";
		ИмяКвиз         = "";
		
		Если ПараметрыJSON.Свойство("quiz") Тогда	
			ИмяКвиз = ?(ПараметрыJSON.quiz.Свойство("name"), ПараметрыJSON.quiz.name, Неопределено);
			ИмяКвиз = " " + ИмяКвиз;
			ИдКвиз  = ?(ПараметрыJSON.quiz.Свойство("id")  , ПараметрыJSON.quiz.id  , Неопределено);
		КонецЕсли;
		
		Если ПараметрыJSON.Свойство("extra") Тогда
			
			СсылкаИсточника = ?(ПараметрыJSON.extra.Свойство("href"), ПараметрыJSON.extra.href, Неопределено);
			
			Если ПараметрыJSON.extra.Свойство("cookies") Тогда
				
				ga = ?(ПараметрыJSON.extra.cookies.Свойство("_ga")    , ПараметрыJSON.extra.cookies._ga    , Неопределено);
				
				Если ПараметрыJSON.extra.cookies.Свойство("_ym_cid") Тогда
					ym_cid = ПараметрыJSON.extra.cookies._ym_cid;
				ИначеЕсли ПараметрыJSON.extra.cookies.Свойство("_ym_uid") Тогда
					ym_cid = ПараметрыJSON.extra.cookies._ym_uid;
				КонецЕсли;
				
				ПараметрыUTM.Вставить("ga_cid", ga);
				ПараметрыUTM.Вставить("ym_cid", ym_cid);
			КонецЕсли;
			
			Если ПараметрыJSON.extra.Свойство("utm") И ЗначениеЗаполнено(ПараметрыJSON.extra.utm) Тогда
				
				utm_campaign	 = ?(ПараметрыJSON.extra.utm.Свойство("name")   , ПараметрыJSON.extra.utm.name   , Неопределено);
				utm_content	     = ?(ПараметрыJSON.extra.utm.Свойство("content"), ПараметрыJSON.extra.utm.content, Неопределено);
				utm_medium	     = ?(ПараметрыJSON.extra.utm.Свойство("medium") , ПараметрыJSON.extra.utm.medium , Неопределено);
				utm_source	     = ?(ПараметрыJSON.extra.utm.Свойство("source") , ПараметрыJSON.extra.utm.source , Неопределено);
				utm_term	     = ?(ПараметрыJSON.extra.utm.Свойство("term")   , ПараметрыJSON.extra.utm.term   , Неопределено);
				
				ПараметрыUTM.Вставить("source"  , utm_source  );
				ПараметрыUTM.Вставить("medium"  , utm_medium  );
				ПараметрыUTM.Вставить("campaign", utm_campaign);
				ПараметрыUTM.Вставить("content" , utm_content );
				ПараметрыUTM.Вставить("term"    , utm_term    );
				
			КонецЕсли;
			
		КонецЕсли;	
		
		//ДатаСоздания = Дата(Сред(ДатаСоздания,1,4), Сред(ДатаСоздания,6,2), Сред(ДатаСоздания,9,2), Сред(ДатаСоздания,12,2), Сред(ДатаСоздания,15,2), 00); 
		ДатаСоздания = ТекущаяДатаСеанса();
		
		НачалоДоменногоИмени = СтрНайти(СсылкаИсточника, "/",,, 2);
		КонецДоменногоИмени  = СтрНайти(СсылкаИсточника, "/",,, 3);
		СсылкаИсточника      = Сред(СсылкаИсточника, НачалоДоменногоИмени + 1, КонецДоменногоИмени - НачалоДоменногоИмени - 1);
		
		РекламнаяПлощадка = Справочники.КаналыПривлечения.НайтиПоНаименованию(СсылкаИсточника);
		Если НЕ ЗначениеЗаполнено(РекламнаяПлощадка) Тогда
			РекламнаяПлощадка = Справочники.КаналыПривлечения.СоздатьЭлемент();
			РекламнаяПлощадка.Наименование = СсылкаИсточника;
			РекламнаяПлощадка.Записать();
			РекламнаяПлощадка = РекламнаяПлощадка.Ссылка;
		КонецЕсли;
		
		Комментарий = "";
		Счетчик    = 1;
		Если ТипЗнч(ДанныеЗаписи) = Тип("Массив") Тогда			
			Для Каждого ЭлементМ Из ДанныеЗаписи Цикл				
				Ответ  = ЭлементМ.a;
				Первый = Истина;
				Если ТипЗнч(Ответ) = Тип("Массив") Тогда
					Ответ = "(";
					Для Каждого ЭлементОтвета Из ЭлементМ.a Цикл		
						Ответ = Ответ + ?(Первый, "", ", ") + ЭлементОтвета; 
						Первый = Ложь;	
					КонецЦикла;	
					Ответ = Ответ + ")";
				КонецЕсли;
				
				Комментарий = Комментарий + Счетчик + ":" + ЭлементМ.q + " -" + Ответ + Символы.ПС;
				Счетчик    = Счетчик + 1;
			КонецЦикла;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(РезультатОпроса) И РезультатОпроса.Свойство("title") Тогда
			Комментарий = Комментарий + ?(ЗначениеЗаполнено(Комментарий), Символы.ПС, "") + "Результат опроса: " + РезультатОпроса.title;
		КонецЕсли;
		
		Клиент = Неопределено;
		Если ЗначениеЗаполнено(НомерТелефона) Тогда
			Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Имя = НомерТелефона;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОнлайнЗаявка", Истина);
		ДополнительныеПараметры.Вставить("ИмяКвиз"	   , ИмяКвиз);  
		
		// Создаем входящую заявку.
		Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,
		ДатаСоздания,,
		Имя,,
		НомерТелефона,
		АдресЭП,,
		РекламнаяПлощадка,,
		Комментарий,
		ПараметрыUTM,
		ВнешняяСистема,,
		Клиент,
		ВнешняяСистема.СтруктурнаяЕдиница,,
		ДополнительныеПараметры,
		ДополнительнаяКонтактнаяИнформация
		);
		
		HTTPОтвет = ПолучитьHTTPОтвет(200, "Заявка обработана");
		КодОтвета = 200;
		
	Исключение
		HTTPОтвет = ПолучитьHTTPОтвет(400, ОписаниеОшибки());	
		КодОтвета = 400;
	КонецПопытки;
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
		Стасус                 = ?(КодОтвета = 400, Перечисления.СтасусыЗапросов.ЗавершенСОшибками, Перечисления.СтасусыЗапросов.Выполнен);
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, Стасус, ВремяВыполнения) Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			Стасус, 
			ВремяВыполнения, 
			ВнешняяСистема, 
			, 
			мОтвет, 
			, 
			,
			КодОтвета); 								
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция, возвращает результат создания заявки от Tilda.
//
Функция TildaPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ApiKey         = Запрос.ПараметрыURL.Получить("apikey");
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, Перечисления.ТипыВнешнихСистем.Tilda);
		
		// Логирование
		ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
		
		Если ЛогироватьСобытие > 0 Тогда
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Lead;
			HTTPШаблон     = "Tilda";
			
		КонецЕсли;
		//\\
		
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
			Возврат ПолучитьHTTPОтвет(400, "Внешняя система не найдена");			
		КонецЕсли;
		
		ТелоЗапроса   = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);	
		ПараметрыТела = Новый Структура();
		
		// При преобразовании тела в параметры заменяю "+" на кодировку пробела, 
		// Т.к. параметры приходят перемешанно-закодированными.
		МассивПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РаскодироватьСТроку(СтрЗаменить(Запрос.ПолучитьТелоКакСтроку(), "+", "%20"), СпособКодированияСтроки.КодировкаURL), "&");
		
		Для Каждого ЭлементМассива Из МассивПараметров Цикл	
			ПозицияРазделителя	 = СтрНайти(ЭлементМассива, "=");
			Ключ				 = Сред(ЭлементМассива, 1, ПозицияРазделителя - 1);
			Значение			 = Сред(ЭлементМассива, ПозицияРазделителя + 1);
			РаспарситьСтроку(ПараметрыТела, Ключ, Значение); 				
		КонецЦикла;
		
		Если ПараметрыТела.Свойство("payment") И ТипЗнч(ПараметрыТела.payment) = Тип("Структура") Тогда
			
			// если заказ с таким orderid существует, обновляю комментарий заявки
			communication_id = ?(ПараметрыТела.payment.Свойство("orderid"), ПараметрыТела.payment.orderid, Неопределено);
			СуществующаяЗаявка = ЗаявкаСуществует(communication_id, Перечисления.ТипыВнешнихСистем.Tilda, Истина);
			
			Если СуществующаяЗаявка <> Неопределено Тогда
				
				КомментарийТекущейЗаявки = СформироватьКомментарийПоСтруктуреОплаты(ПараметрыТела);
				Если ПараметрыТела.Свойство("comment") Тогда
		 			КомментарийТекущейЗаявки = ПараметрыТела.comment + Символы.ПС + КомментарийТекущейЗаявки;
 				КонецЕсли;
				Если СтрСравнить(СуществующаяЗаявка.Комментарий, КомментарийТекущейЗаявки) = 0 Тогда
					Возврат ПолучитьHTTPОтвет(200, "Заявка существует, обновление не требуется");
				Иначе	
					ЗаявкаОбъект			 = СуществующаяЗаявка.ПолучитьОбъект();
					ЗаявкаОбъект.Комментарий = КомментарийТекущейЗаявки;
					ЗаявкаОбъект.Записать();
					
					Возврат ПолучитьHTTPОтвет(200, "Заявка обработана, обновлена информация об оплате");
				КонецЕсли;	
				
			КонецЕсли;	
			
		Иначе
			
			communication_id = ?(ПараметрыТела.Свойство("tranid"), ПараметрыТела.tranid, Неопределено);
			
		КонецЕсли;
		
		ПреобразоватьПараметрыCookies(ПараметрыТела);
		Комментарий = СформироватьКомментарийПоСтруктуреОплаты(ПараметрыТела);
		
		НомерТелефона    = ?(ПараметрыТела.Свойство("Phone")			, ПараметрыТела.Phone			, ""          );
		АдресЭП          = ?(ПараметрыТела.Свойство("Email")			, ПараметрыТела.Email			, ""          );
		Имя              = ?(ПараметрыТела.Свойство("Name")				, ПараметрыТела.Name			, Неопределено);
		utm_referrer     = ?(ПараметрыТела.Свойство("utm_referrer")		, ПараметрыТела.utm_referrer	, Неопределено);
		formid           = ?(ПараметрыТела.Свойство("formid")			, ПараметрыТела.formid			, ""          );
		formname		 = ?(ПараметрыТела.Свойство("formname")			, ПараметрыТела.formname		, ""          );
		utm_campaign	 = ?(ПараметрыТела.Свойство("utm_campaign")		, ПараметрыТела.utm_campaign	, Неопределено);
		utm_content	     = ?(ПараметрыТела.Свойство("utm_content")		, ПараметрыТела.utm_content		, Неопределено);
		utm_medium	     = ?(ПараметрыТела.Свойство("utm_medium")		, ПараметрыТела.utm_medium		, Неопределено);
		utm_source	     = ?(ПараметрыТела.Свойство("utm_source")		, ПараметрыТела.utm_source		, Неопределено);
		utm_term	     = ?(ПараметрыТела.Свойство("utm_term")			, ПараметрыТела.utm_term		, Неопределено);
		ga_cid			 = ?(ПараметрыТела.Свойство("googleClientId")	, ПараметрыТела.googleClientId	, Неопределено);
		ym_cid			 = ?(ПараметрыТела.Свойство("yandexClientId")	, ПараметрыТела.yandexClientId	, Неопределено);

		ga_cid			 = ?(ПараметрыТела.Свойство("Cookies") И ПараметрыТела.Cookies.Свойство("_ga")		, ПараметрыТела.Cookies._ga		, ga_cid);
		ym_cid			 = ?(ПараметрыТела.Свойство("Cookies") И ПараметрыТела.Cookies.Свойство("_ym_uid")	, ПараметрыТела.Cookies._ym_uid	, ym_cid);
		
		Если ПараметрыТела.Свойство("SurName") Тогда 
			Фамилия = ПараметрыТела.SurName;
		ИначеЕсли Параметрытела.Свойство("LastName") Тогда
			Фамилия = ПараметрыТела.LastName;
		Иначе
			Фамилия = Неопределено;
		КонецЕсли;
		
		ВремяСоздания = ТекущаяДатаСервера();
		
		НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
		НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
		НомерТелефона = СтрЗаменить(НомерТелефона, "(", "");
		НомерТелефона = СтрЗаменить(НомерТелефона, ")", "");
		НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
		
		Клиент = Неопределено;
		Если ЗначениеЗаполнено(НомерТелефона) Тогда
			Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Имя) И Не ЗначениеЗаполнено(Фамилия) Тогда
			Имя = НомерТелефона;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Комментарий) Тогда
			
			Комментарий = "Заявка от Tilda" + ?(ЗначениеЗаполнено(formname), " formname = " + СтрЗаменить(formname, "formname", ""), "") + ?(ЗначениеЗаполнено(formid), " Formid = " + СтрЗаменить(formid, "form", ""), "");
			Если ПараметрыТела.Свойство("comment") Тогда
	 			Комментарий = ПараметрыТела.comment + Символы.ПС + Комментарий;
			КонецЕсли;
		
			ДополнитьКомментарийНеобработаннымиПараметрами(Комментарий, ПараметрыТела);
			
		КонецЕсли;
		
		ПараметрыUTM = Новый Структура();
		ПараметрыUTM.Вставить("source"  , utm_source  );
		ПараметрыUTM.Вставить("medium"  , utm_medium  );
		ПараметрыUTM.Вставить("campaign", utm_campaign);
		ПараметрыUTM.Вставить("content" , utm_content );
		ПараметрыUTM.Вставить("term"    , utm_term    );
		ПараметрыUTM.Вставить("ga_cid"  , ga_cid	  );
		ПараметрыUTM.Вставить("ym_cid"  , ym_cid	  );
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОнлайнЗаявка", Истина);
		
		// Создаем входящую заявку.
		Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(
		communication_id,,
		ВремяСоздания,
		Фамилия,
		Имя,,
		НомерТелефона,
		АдресЭП,,
		Справочники.КаналыПривлечения.ЛовецЛидов,
		utm_referrer,
		Комментарий,
		ПараметрыUTM,
		ВнешняяСистема,,
		Клиент,
		ВнешняяСистема.СтруктурнаяЕдиница,,
		ДополнительныеПараметры);
		
		HTTPОтвет = ПолучитьHTTPОтвет(200, "Заявка обработана");
		КодОтвета = 200;
		
	Исключение
		HTTPОтвет = ПолучитьHTTPОтвет(400, ОписаниеОшибки());	
		КодОтвета = 400;
	КонецПопытки;
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		мОтвет                 = HTTPОтвет.ПолучитьТелоКакСтроку();
		Стасус                 = ?(КодОтвета = 400, Перечисления.СтасусыЗапросов.ЗавершенСОшибками, Перечисления.СтасусыЗапросов.Выполнен);
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, Стасус, ВремяВыполнения) Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			Стасус, 
			ВремяВыполнения, 
			ВнешняяСистема, 
			, 
			мОтвет, 
			, 
			,
			КодОтвета); 								
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Распарсить строку
//
Процедура РаспарситьСтроку(ПараметрыТела, Ключ, Значение) 	
	
	Если СтрНайти(Ключ, "[") <> 0 Тогда
		
		Ключ = СтрРазделить(Ключ, "[");
		Если Прав(Ключ[1], 1) = "]" Тогда
			Ключ[1] = Лев(Ключ[1], СтрДлина(Ключ[1]) - 1);
		КонецЕсли;
		
		Попытка
			Ключ[0] = Число(Ключ[0]);
		Исключение
		КонецПопытки;  		
		
		Если ТипЗнч(Ключ[0]) <> Тип("Число") 
			И Не ПараметрыТела.Свойство(Ключ[0]) Тогда 
			
			Попытка
				
				Если Ключ.Количество() > 1 Тогда 
					
					Индекс = Число(Лев(Ключ[1], 1));					
					ПараметрыТела.Вставить(Ключ[0], Новый Массив());
					
				КонецЕсли;
				
			Исключение
				ПараметрыТела.Вставить(Ключ[0], Новый Структура());				
			КонецПопытки;
			
		КонецЕсли;
		
		Если Ключ.Количество() > 2 Тогда
			
			Пока Ключ.Количество() > 1 Цикл
				
				времКлюч = "" + времКлюч + Ключ[1] + ?(Ключ.Количество()>2, "[", "");
				
				Ключ.Удалить(1);
				
			КонецЦикла;
			
			РаспарситьСтроку(ПараметрыТела[Ключ[0]], времКлюч, Значение);
		Иначе
			
			Если ТипЗнч(Ключ[0]) = Тип("Число") 
				И ТипЗнч(ПараметрыТела) = Тип("Массив") 
				И ПараметрыТела.Количество() = Ключ[0] Тогда 
				ПараметрыТела.Добавить(Новый Структура());				
			КонецЕсли;
			РаспарситьСтроку(ПараметрыТела[Ключ[0]], Ключ[1], Значение);
			
		КонецЕсли;	
		
	Иначе 
		RawDataВСтруктуру(ПараметрыТела, Ключ, Значение);			
	КонецЕсли;
	
КонецПроцедуры   

// Функция, возвращает строку, содержащую сведения об оплате. 
//
Функция СформироватьКомментарийПоСтруктуреОплаты(ПараметрыТела)
	
	Если ПараметрыТела.Свойство("payment") И ТипЗнч(ПараметрыТела.payment) = Тип("Структура") Тогда
		
		СтруктураОплаты = ПараметрыТела.payment;
		
		СписокТоваров = "";
		
		Счетчик = 1;
		Для Каждого ПозицияОплаты Из СтруктураОплаты.products Цикл
			СписокТоваров = СписокТоваров + Счетчик + ". " + ПозицияОплаты.name + ", " + ПозицияОплаты.options[0].option + " - " + ПозицияОплаты.options[0].variant
			+ "; " + ПозицияОплаты.quantity + " шт * " + ПозицияОплаты.price + " руб." + " = " + ПозицияОплаты.amount + " руб." + Символы.ПС;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		Если СтруктураОплаты.Свойство("sys") И СтруктураОплаты.Свойство("systranid") Тогда
			СтатусОплаты  = "Заказ оплачен " + СтруктураОплаты.sys + Символы.ПС +
			"ИД транзакции: " + СтруктураОплаты.systranid + Символы.ПС;
		Иначе
			СтатусОплаты  = "Заказ не оплачен" + Символы.ПС;
		КонецЕсли;
		
		МассивИсключаемыхСвойств = Новый Массив;
		МассивИсключаемыхСвойств.Добавить("sys");
		МассивИсключаемыхСвойств.Добавить("systranid");
		МассивИсключаемыхСвойств.Добавить("orderid");
		МассивИсключаемыхСвойств.Добавить("products");
		МассивИсключаемыхСвойств.Добавить("delivery");
		МассивИсключаемыхСвойств.Добавить("delivery_price");
		МассивИсключаемыхСвойств.Добавить("delivery_address");
		МассивИсключаемыхСвойств.Добавить("delivery_fio");
		МассивИсключаемыхСвойств.Добавить("delivery_comment");
		МассивИсключаемыхСвойств.Добавить("amount");
		МассивИсключаемыхСвойств.Добавить("subtotal");
		
		ДополнительныеПараметры = "";
		
		Для Каждого КлючИЗначение Из СтруктураОплаты Цикл
			Если МассивИсключаемыхСвойств.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
				ДополнительныеПараметры = ДополнительныеПараметры + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение + Символы.ПС;
			КонецЕсли;
		КонецЦикла;	
		
		Комментарий =
		"Заказ " + СтруктураОплаты.orderid + " на сумму " + СтруктураОплаты.amount + " руб." + Символы.ПС +
		"Товары: " + Символы.ПС + СписокТоваров + Символы.ПС +
		"Оплата: " + Символы.ПС + СтатусОплаты + Символы.ПС +
		"Доставка: " + Символы.ПС +
		"Способ: " + СтруктураОплаты.delivery + " - Стоимость: " + СтруктураОплаты.delivery_price + " руб." + Символы.ПС +
		"Адрес: " + СтруктураОплаты.delivery_address + Символы.ПС +
		"Получатель: " + СтруктураОплаты.delivery_fio + Символы.ПС +
		"Комментарий: " + СтруктураОплаты.delivery_comment +
		?(ДополнительныеПараметры = "", "", Символы.ПС + Символы.ПС + "Дополнительные параметры: " + Символы.ПС + ДополнительныеПараметры);
		
		Возврат Комментарий;
		
	ИначеЕсли ПараметрыТела.Свойство("payment") И ТипЗнч(ПараметрыТела.payment) = Тип("Строка") Тогда	
		Возврат "Заявка от Tilda" + ?(ЗначениеЗаполнено(ПараметрыТела.formname), " formname = " + СтрЗаменить(ПараметрыТела.formname, "formname", ""), "")
		+ ?(ЗначениеЗаполнено(ПараметрыТела.formid), " Formid = " + СтрЗаменить(ПараметрыТела.formid, "form", ""), "") + Символы.ПС + ПараметрыТела.payment;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

// Функция, возвращает структуру, содержащую дополнительные контакты заявки.
//
Функция СформироватьСтруктуруКонтактнойИнформации(СтруктураКонтактов)
	
	Если ТипЗнч(СтруктураКонтактов) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	
	Для Каждого Контакт Из СтруктураКонтактов Цикл
		
		Если НРег(Контакт.Ключ) = "name" Или НРег(Контакт.Ключ) = "email" Или НРег(Контакт.Ключ) = "phone" Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураВозврата.Вставить(Контакт.Ключ, Контакт.Значение);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция, возвращает Истина или ссылку на заявку если заявка с таким communication_id уже существует.
//
Функция ЗаявкаСуществует(communication_id, ТипВнешнейСистемы, ВозвращатьЗаявку = Ложь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	Заявки.communication_id = &communication_id
	|	И Заявки.ВнешняяСистема.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("communication_id", communication_id);
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", ТипВнешнейСистемы);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ?(ВозвращатьЗаявку = Истина, Неопределено, Ложь);
	Иначе
		Возврат ?(ВозвращатьЗаявку = Истина, Результат.Выгрузить()[0].Ссылка, Истина);
	КонецЕсли;
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(КодОтвета, Описание)
	
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(Описание);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";	
	
	Возврат HTTPОтвет; 
	
КонецФункции

// Процедура, преобразовывает параметры cookies в структуру заменяет параметр в исходной структуре.
//
Процедура ПреобразоватьПараметрыCookies(ПараметрыТела)
	
	Если ПараметрыТела.Свойство("COOKIES") Тогда
		
		СтруктураCookies = Новый Структура;
		
		МассивПараметров = СтрРазделить(ПараметрыТела.Cookies, ";");
		
		Для Каждого ЭлементМассива Из МассивПараметров Цикл
			Массив = СтрРазделить(ЭлементМассива, "=");
			РаспарситьСтроку(СтруктураCookies, Массив[0], Массив[1]);
		КонецЦикла;
		
		Если СтруктураCookies.Свойство("previousUrl") Тогда
			СтруктураCookies.previousUrl = РаскодироватьСтроку(СтруктураCookies.previousUrl, СпособКодированияСтроки.КодировкаURL);
		КонецЕсли;
		
		ПараметрыТела.Вставить("Cookies", СтруктураCookies);
		
	КонецЕсли;	
	
КонецПроцедуры   

// Процедура, дополняет комментарий, добавляя к нему значения параметров, которые не были обработаны.
//
Процедура ДополнитьКомментарийНеобработаннымиПараметрами(Комментарий, ПараметрыТела)
	
	НеобработанныеПараметры = Новый Массив;
	
	ИсключаемыеПараметры = Новый Массив;
	ИсключаемыеПараметры.Добавить("comment");
	ИсключаемыеПараметры.Добавить("payment");
	ИсключаемыеПараметры.Добавить("phone");
	ИсключаемыеПараметры.Добавить("email");
	ИсключаемыеПараметры.Добавить("name");
	ИсключаемыеПараметры.Добавить("utm_referrer");
	ИсключаемыеПараметры.Добавить("utm_campaign");
	ИсключаемыеПараметры.Добавить("utm_content");
	ИсключаемыеПараметры.Добавить("utm_medium");
	ИсключаемыеПараметры.Добавить("utm_source");
	ИсключаемыеПараметры.Добавить("formid");
	ИсключаемыеПараметры.Добавить("formname");
	ИсключаемыеПараметры.Добавить("cookies");
	ИсключаемыеПараметры.Добавить("surname");
	ИсключаемыеПараметры.Добавить("lastname");
	ИсключаемыеПараметры.Добавить("googleclientid");
	ИсключаемыеПараметры.Добавить("yandexclientid");
	
	Для Каждого ПолеСтруктуры Из ПараметрыТела Цикл
		Если ИсключаемыеПараметры.Найти(НРег(ПолеСтруктуры.Ключ)) = Неопределено Тогда
			НеобработанныеПараметры.Добавить(ПолеСтруктуры.Ключ + ": " + ПолеСтруктуры.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеПараметры = ?(
		ЗначениеЗаполнено(НеобработанныеПараметры),
		Символы.ПС + Символы.ПС + "Дополнительные параметры:" + Символы.ПС + СтрСоединить(НеобработанныеПараметры, Символы.ПС),
		""
	);
	
	Комментарий = Комментарий + ДополнительныеПараметры;
	
КонецПроцедуры

// Процедура - Raw data в структуру
//
Процедура RawDataВСтруктуру(ПараметрыТела, Ключ, Значение)
	
	Если Лев(Ключ, 1) = "[" Тогда
		Ключ = Прав(Ключ, СтрДлина(Ключ) - 1);
	КонецЕсли;
	
	ПараметрыТела.Вставить(СтрЗаменить(Ключ, "-", ""), Значение);
	
КонецПроцедуры

#КонецОбласти
